{
  "resume": [
    {
      "id": 1,
      "company": "Binance",
      "title": "Contract Software Engineer",
      "startDate": "April 2023",
      "endDate": "October 2023",
      "team": ".COM",
      "description": [
        "Optimized full-stack financial dashboards, enhancing trader engagement and reducing dashboard latency by 20%.",
        "Monitored performance with AWS CloudWatch and Elastic Stack, proactively addressing bottlenecks to maintain 99.9% uptime.",
        "Built cross-browser responsive UI components to enhance user accessibility across global markets.",
        "Mentored junior engineers in full-stack practices and scalable architecture.",
        "Implemented GraphQL APIs, improving backend code reuse and enabling faster integration for internal teams."
      ],
      "techStack": [
        "React",
        "Python",
        "GraphQL",
        "AWS Lambda",
        "CloudWatch",
        "Elastic Stack",
        "TypeScript",
        "Git"
      ],
      "logo": "/BinanceLogo.png",
      "hexcode": "333333"
    },
    {
      "id": 2,
      "company": "Coursera",
      "title": "Software Engineer",
      "startDate": "February 2022",
      "endDate": "November 2022",
      "team": "Educator Admin Platform",
      "description": [
        "Designed access control and real-time analytics modules using AWS and MySQL to support 5,000+ instructors.",
        "Built backend APIs and frontend interfaces for Educator Home 2.0 to streamline course setup and boost user engagement.",
        "Wrote Python automation scripts to validate course data integrity, reducing manual QA effort by 30%.",
        "Implemented custom telemetry to improve system observability and surface backend performance bottlenecks.",
        "Resolved critical issues during on-call rotations, ensuring uninterrupted platform accessibility."
      ],
      "techStack": [
        "Python",
        "React",
        "TypeScript",
        "AWS",
        "MySQL",
        "Git",
        "GraphQL",
        "Jest",
        "Cypress"
      ],
      "logo": "/CourseraLogo.png",
      "hexcode": "0055d3"
    },
    {
      "id": 3,
      "company": "Coursera",
      "title": "Software Engineering Intern",
      "startDate": "September 2021",
      "endDate": "December 2021",
      "team": "Educator Admin Platform",
      "description": [
        "Developed full-stack features for Educator Home and Course Staff Management using React, Python, GraphQL to streamline instructor workflows.",
        "Constructed modular API endpoints for course management and rendered dynamic content through Storybook-driven UI components.",
        "Participated in product A/B testing and backend instrumentation to support data-driven feature rollouts.",
        "Implemented user usage logging via Full Story and Data Dog to gain insightful data on Recently Viewed Course's impact",
        "Enhanced accessibility and cohesiveness by 30% through the successful migration of Coursera UI to Coursera Design System"
      ],
      "techStack": [
        "Python",
        "GraphQL",
        "React",
        "TypeScript",
        "HTML5",
        "CSS3",
        "Storybook",
        "Git",
        "Enzyme",
        "Jest"
      ],
      "logo": "/CourseraLogo.png",
      "hexcode": "0055d3"
    },
    {
      "id": 4,
      "company": "Beatdapp",
      "title": "Software Engineering Intern",
      "startDate": "May 2020",
      "endDate": "September 2020",
      "team": "Beatdapp, Renaissance, AWOL",
      "description": [
        "Successfully implemented the foundational user experience for the company’s mobile application, Renaissance",
        "Spearheaded the creation of the tailored mobile application, AWOL, demonstrating leadership throughout the project life cycle",
        "Project AWOL – Managed and implemented the progress of internal games, engineered a sophisticated algorithm for calculating users’ rank within the company which led to cultivating a competitive yet engaging company culture"
      ],
      "techStack": [
        "React",
        "React Native",
        "iOS",
        "Xcode",
        "Expo",
        "MySQL",
        "Sequelize",
        "Node.js",
        "Express.js"
      ],
      "logo": "/BeatdappLogo.png",
      "hexcode": "932dca"
    },
    {
      "id": 5,
      "company": "SAP",
      "title": "Software Engineering Intern",
      "startDate": "September 2018",
      "endDate": "August 2019",
      "team": "User Assistance Content Portal, Hybris",
      "description": [
        "Developed internal tools, streamlining workflows and cutting task completion time by 20%.",
        "Migrated enterprise admin dashboards from Angular to React, reducing load time by 40% and improving maintainability.",
        "Collaborated with DevOps to improve server-side logging and backend debugging tools, reducing time-to-resolution by 25%.",
        "Enhanced efficiency by strategically migrating automation tests from Protractor.js to Nightwatch.js"
      ],
      "techStack": [
        "Angular",
        "React",
        "TypeScript",
        "HTML5",
        "CSS3",
        "Git",
        "Docker"
      ],
      "logo": "/SAPLogo.png",
      "hexcode": "00427b"
    }
  ]
}
